///@brief 分别求两个升序序列A、B的中位数，设为a和b，求序列A、B的中位数
///@param A 序列A
///@param B 序列B
///@param n 序列AB的长度
int M_Search(int A[], int B[], int n)
{
    int s1,d1,m1,s2,d2,m2;
    s1 = 0;
    d1 = n-1;
    s2 = 1;
    d2 = n-1;
    while (s1 != d1 || s2 != d2)
    {
        m1 = (s1+d1)/2;
        m2 = (s2+d2)/2;
        if (A[m1] == B[m2])
            return A[m1];           //若a=b则a或b即为所求中位数
        if (A[m1] < B[m2])          //若a<b则舍弃序列A中较小的一半，同时舍弃序列B中较大的一半，两次舍弃的长度相等
        {
            if ((s1+d1)%2 == 0)     //若元素个数为奇数
            {
                s1 = m1;            //舍弃A中间点以前的部分，且保留中间点
                d2 = m2;            //舍弃B中间点以后的部分，且保留中间点
            }
            else                    //元素个数为偶数
            {
                s1 = m1+1;          //舍弃A的前半部分
                d2 = m2;            //舍弃B的后半部分
            }
        }
        else                        //若a>b则舍弃序列A中较大的一半，同时舍去序列B中较小的一半，两次舍弃的长度相等
        {
            if ((s1+d1)%2 == 0)     //若元素个数为奇数
            {
                d1 = m1;            //舍弃A中间点以后的部分，且保留中间点
                s2 = m2;            //舍弃B中间点以前的部分，且保留中间点
            }
            else                    //元素个数为偶数
            {
                d1 = m1;            //舍弃A的后半部分
                s2 = m2+1;          //舍弃B的前半部分
            }
        }
    }
    return A[s1]<B[s2]?A[s1]:B[s2];
}
